app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "author", "updated_at", "post_id", "site", "email") VALUES('Teste', '2010-02-21 06:40:34', 'Felipe', '2010-02-21 06:40:34', NULL, 'www.sourceprime.blogspot.com', 'febsilveira@hotmail.com')

  def update
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 3)