app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments".post_id = 1)
---
  def show
    @post = Post.find(params[:id])
    @comments = Comment.find(:all)

INSERT INTO "posts" ("created_at", "author", "title", "post", "updated_at") VALUES('2010-02-21 06:29:30', 'Felipe Silveira', 'Novo Post', 'Esqueci de tirar os h dos forms e adicionar o gsub =/', '2010-02-21 06:29:30')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save